# ==============================================================================
# Brewfile — Mac Setup
# Run with: brew bundle --file=Brewfile
# Lock file (Brewfile.lock.json) is committed — versions are pinned.
# To upgrade everything: brew bundle --file=Brewfile --force
# ==============================================================================

# ── Taps ──────────────────────────────────────────────────────────────────────
tap "mas-cli/tap"
tap "microsoft/git"

# ── Git ───────────────────────────────────────────────────────────────────────
brew "gh"                        # GitHub CLI
brew "git"                       # Git
brew "git-lfs"                   # Git Large File Storage
cask "git-credential-manager"    # Cross-platform Git credential storage

# ── Shell / Prompt ────────────────────────────────────────────────────────────
cask "font-fira-code"            # Fira Code (Nerd Font variant for Starship icons)
brew "starship"                  # Cross-shell prompt

# ── Browsers ──────────────────────────────────────────────────────────────────
cask "firefox"
cask "google-chrome"

# ── Docker / Containers ───────────────────────────────────────────────────────
cask "rancher"                   # Rancher Desktop (container runtime)
brew "docker-compose"            # Docker Compose plugin
brew "docker-credential-helper"  # Credential helper for Docker registries

# ── CLI Tools ─────────────────────────────────────────────────────────────────
brew "aria2"                     # Lightweight multi-protocol download utility
brew "gradle"                    # Build automation (JVM)
brew "imagemagick"               # Image processing
brew "jq"                        # JSON processor
brew "mise"                      # Runtime version manager (node, python, ruby, etc.)
brew "syft"                      # SBOM generator
brew "telnet"                    # Telnet client
brew "tree"                      # Directory listing as a tree
brew "xcodes"                    # Manage Xcode versions (CLI)
brew "yq"                        # YAML processor

# ── Ruby build dependencies ──────────────────────────────────────────────────
brew "libyaml"                   # psych (YAML) extension
brew "openssl@3"                 # openssl extension (shared with PHP)
brew "readline"                  # readline extension

# ── PHP build tools (keg-only; prepended to PATH before mise compiles PHP) ───
brew "autoconf"                  # buildconf / ./configure
brew "automake"                  # required alongside autoconf
brew "bison"                     # parser generator >= 3.0.0
brew "libtool"                   # build system support (GNU libtoolize)
brew "pkg-config"                # lets the compiler locate all Homebrew libs
brew "re2c"                      # lexer generator, required at compile time

# ── PHP extension dependencies ────────────────────────────────────────────────
brew "bzip2"                     # bz2 extension
brew "curl"                      # curl extension (system curl lacks required flags)
brew "freetype"                  # GD font rendering
brew "gd"                        # GD image processing (bundles jpeg, png, webp)
brew "gmp"                       # gmp extension (arbitrary precision math)
brew "icu4c"                     # intl extension (Unicode / locale support)
brew "jpeg-turbo"                # GD JPEG support
brew "krb5"                      # Kerberos (used by curl + openssl)
brew "libiconv"                  # iconv extension
brew "libpng"                    # GD PNG support
brew "libsodium"                 # sodium extension
brew "libxml2"                   # xml / dom / simplexml extensions
brew "libzip"                    # zip extension
brew "oniguruma"                 # mbstring extension
brew "sqlite"                    # PDO SQLite
brew "tidy-html5"                # tidy extension (HTML cleanup)
brew "webp"                      # GD WebP support
brew "zlib"                      # zlib / deflate extension

# ── Apps (Cask) ───────────────────────────────────────────────────────────────
cask "1password"                 # 1Password password manager
cask "jetbrains-toolbox"         # JetBrains IDE manager
cask "bruno"                     # API client (open-source Postman alternative)
cask "spotify"                   # Music streaming
cask "xcodes-app"                    # Xcode version manager (GUI)

# ── App Store (mas) ───────────────────────────────────────────────────────────
mas "Magnet",         id: 441258766   # Window manager
mas "Pixelmator Pro", id: 1289583905  # Image editor
