# ==============================================================================
# Brewfile — Mac Setup
# Run with: brew bundle --file=Brewfile
# Lock file (Brewfile.lock.json) is committed — versions are pinned.
# To upgrade everything: brew bundle --file=Brewfile --force
# ==============================================================================

# ── Taps ──────────────────────────────────────────────────────────────────────
tap "mas-cli/tap"
tap "microsoft/git"

# ── Git ───────────────────────────────────────────────────────────────────────
brew "gh"                        # GitHub CLI
brew "git"                       # Git
brew "git-lfs"                   # Git Large File Storage
cask "git-credential-manager"    # Cross-platform Git credential storage

# ── Shell / Prompt ────────────────────────────────────────────────────────────
cask "font-fira-code"            # Fira Code (Nerd Font variant for Starship icons)
brew "starship"                  # Cross-shell prompt

# ── Browsers ──────────────────────────────────────────────────────────────────
cask "firefox"
cask "google-chrome"

# ── Docker / Containers ───────────────────────────────────────────────────────
cask "rancher"                   # Rancher Desktop (container runtime)
brew "docker-compose"            # Docker Compose plugin
brew "docker-credential-helper"  # Credential helper for Docker registries

# ── CLI Tools ─────────────────────────────────────────────────────────────────
brew "aria2"                     # Lightweight multi-protocol download utility
brew "gradle"                    # Build automation (JVM)
brew "imagemagick"               # Image processing
brew "jq"                        # JSON processor
brew "mise"                      # Runtime version manager (node, python, ruby, etc.)
brew "syft"                      # SBOM generator
brew "telnet"                    # Telnet client
brew "tree"                      # Directory listing as a tree
brew "xcodes"                    # Manage Xcode versions (CLI)
brew "yq"                        # YAML processor

# ── PHP & Ruby build dependencies (native extensions on Apple Silicon) ───────
brew "libyaml"                   # Ruby: psych (YAML) build dep
brew "openssl@3"                 # Ruby + PHP: TLS/crypto
brew "readline"                  # Ruby: readline extension build dep
brew "bzip2"                     # PHP: bz2 extension
brew "curl"                      # PHP: curl extension (system curl lacks flags)
brew "icu4c"                     # PHP: intl extension (Unicode/locale support)
brew "krb5"                      # PHP: Kerberos (used by curl + openssl)
brew "libiconv"                  # PHP: iconv extension
brew "libsodium"                 # PHP: sodium extension
brew "libxml2"                   # PHP: xml/dom/simplexml extensions
brew "libzip"                    # PHP: zip extension
brew "oniguruma"                 # PHP: mbstring extension
brew "pkg-config"                # Lets the compiler locate all Homebrew libs
brew "autoconf"                  # PHP: required to run buildconf before ./configure
brew "automake"                  # PHP: required alongside autoconf
brew "gmp"                       # PHP: gmp extension (arbitrary precision math)
brew "libtool"                   # PHP: required by the build system alongside autoconf
brew "re2c"                      # PHP: lexer generator (required at compile time)
brew "zlib"                      # PHP: zlib/deflate extension

# ── Apps (Cask) ───────────────────────────────────────────────────────────────
cask "1password"                 # 1Password password manager
cask "jetbrains-toolbox"         # JetBrains IDE manager
cask "bruno"                     # API client (open-source Postman alternative)
cask "spotify"                   # Music streaming
cask "xcodes-app"                    # Xcode version manager (GUI)

# ── App Store (mas) ───────────────────────────────────────────────────────────
mas "Magnet",         id: 441258766   # Window manager
mas "Pixelmator Pro", id: 1289583905  # Image editor
